In [2]:
import pandas as pd

In [4]:
os.chdir(r'C:\Users\FUTURE\Documents\examples')

In [36]:
df = pd.read_csv('k1.csv', header= None)

In [37]:
df

   0   1   2   3          4
0  a   b   c   d     Python
1  1   2   3   4          R
2  5   6   7   8  Analytics
3  9  10  11  12         ML

In [10]:
type(df)

pandas.core.frame.DataFrame

In [14]:
df.head(2)

   a  b  c  d     Python
0  1  2  3  4          R
1  5  6  7  8  Analytics

In [16]:
df.tail(2)

   a   b   c   d     Python
1  5   6   7   8  Analytics
2  9  10  11  12         ML

In [18]:
df['c']

0     3
1     7
2    11
Name: c, dtype: int64

In [20]:
type(df['c'])

pandas.core.series.Series

In [22]:
l = [4,5,6,7]

In [24]:
l

[4, 5, 6, 7]

In [26]:
df['c']

0     3
1     7
2    11
Name: c, dtype: int64

In [28]:
df

   a   b   c   d     Python
0  1   2   3   4          R
1  5   6   7   8  Analytics
2  9  10  11  12         ML

In [31]:
df[['c','d']]

    c   d
0   3   4
1   7   8
2  11  12

In [33]:
type(df[['c','d']])

pandas.core.frame.DataFrame

In [35]:
list(df['c'])

[3, 7, 11]

In [42]:
df2 = pd.read_table('test.tsv', header = None)

In [44]:
df2

    0   1   2   3   4   5
0  s1  s2  s3  s4  s5  s6
1   r   a   k   u   z   y

In [56]:
df3 = pd.read_csv('test.tsv', sep = '\t',header = None )

In [57]:
df3

    0   1   2   3   4   5
0  s1  s2  s3  s4  s5  s6
1   r   a   k   u   z   y

In [61]:
df3 = pd.read_csv('test.tsv', sep = '\t', names = ['x','y','z','a','b','c','hdfjkg'])

In [62]:
df3

    x   y   z   a   b   c  hdfjkg
0  s1  s2  s3  s4  s5  s6     NaN
1   r   a   k   u   z   y     NaN